{"license":"MIT","file_hash":null,"name":"GeoLogic","version":"0.2.1","description":"Package for geotechnical modelling using Dynamo / Revit. As it is developed as a part of my research, some nodes might work non-intuitively and unstable.  Design calculations are mainly build around german / EU regulations.","group":"","keywords":null,"dependencies":[],"host_dependencies":["CPython3"],"contents":"Convert_Dynamo_Point - Converts a list of Dynamo Points to a target type (such as list, tuple, xyz), EA_Pfaehle_Tab_5_12 - Calculates q_bk for bored piles in non-cohesive soils based on a given q_c, EA_Pfaehle_Tab_5_13 - gets q_sk for a bored pile in non-cohesive soils based on a given q_c, EA_Pfaehle_Tab_5_14 - Calculates the q_bk for a bored pile in cohesive soils given its c_uk, EA_Pfaehle_Tab_5_15 - Calculates the q_sk for bored piles in cohesive soils based on given c_uk, EA_Pfaehle_Tab_5_16 - Calculates q_bk and q_sk for bored piles in rock for given q_uk, Earth_Pressure_Coefficient - Calculates the earth pressure coefficients. See info (debug dict) for help., Geom_To_Voxel - Converts a geometry to its voxel representation., Get_Fill_Pattern_Element_By_Name - Gets a Fill Pattern Element given its name as a string. Fill pattern needs to be inside current Revit doc., Ifc_Info - Gets some basic information of an ifc file given its path as a string, Interpolate_Points - Implementation of various interpolation methods. Interpolates z-values based on x,y values, Place_Curved_Section_On_Sheet - Places a curved section on a sheet\r\nCurced section is approximated by several linear sections which are alligned, Python_From_String - PythonFromString with default python environment setup, Python_Template - This node contains a general python template for working with Revit / Dynamo, Random_Points - Creates a given number of randomly placed Dynamo Points, Solid_By_Top_Bottom_Polysurface - Creates a solid from a top and bottom polysurface by splitting it into surfaces, extruding their perimeter curves to solid and calculating the boolean difference.\r\nTop and Bottom Surface need the same amount of vertices / surfaces to work as expected, Solid_By_Top_Bottom_Surface - Creates a solid given a top and bottom surface by computing the perimeter curves. Tries to loft in between them and then creates a solid by joining the surfaces.\r\nQuality of the result varies..., Triangulate_Delauny - Creates a triangulated surface given a selection of DynamoPoints. Retruns either Topo, Surfaces, PolySurface or Mesh","engine_version":"2.13.1.3891","engine":"dynamo","engine_metadata":"","site_url":"","repository_url":"https://github.com/GeotechnicalBIM/GeoLogic_Dynamo","contains_binaries":false,"node_libraries":[],"copyright_holder":"Johannes Beck","copyright_year":"2022"}